In [3]:
# import library
import pandas as pd
import numpy as np 
import mysql.connector
import sqlalchemy as alc
from sqlalchemy import create_engine

In [4]:
# untuk menggunakan SQLalchemy
engine=create_engine('mysql+mysqlconnector://root:a09101993@localhost/sakila')

In [5]:
# menampilkan seluruh tabel dalam database sakila
query = '''
show full tables;
'''
pd.read_sql_query(query,engine)

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

In [60]:
# menampilkan isi dari tabel film_actor sebagai referensi
query = '''
select * from film_actor
limit 2;
'''
pd.read_sql_query(query,engine)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03

In [59]:
# menampilkan isi dari tabel actor sebagai referensi
query = '''
select * from actor
limit 2;
'''
pd.read_sql_query(query,engine)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33

In [6]:
# menampilkan isi dari tabel film sebagai referensi
query = '''
select * from film
limit 2;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42

In [7]:
# menampilkan isi dari tabel film_category sebagai referensi
query = '''
select * from film_category
limit 2;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09

In [8]:
# menampilkan isi dari tabel category sebagai referensi
query = '''
select * from category
limit 2;
'''
pd.read_sql_query(query,engine)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27

### 1. Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan durasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [29]:
# jawaban dari soal nomor 1
query = '''
select film.title, category.name as category, film.length from film
join film_category
on film.film_id = film_category.film_id
join category
on film_category.category_id = category.category_id
where name = 'comedy'
order by length
limit 10;
'''
pd.read_sql_query(query,engine)
# pertama, select kolom dan rename nama kolom yang ingin ditampilkan serta join 3 table berdasarkan key masing-masing table
# kemudian, tampilkan film yang memiliki category.name = comedy 
# terakhir, urutkan data tersebut berdasarkan length (dari kecil ke besar) dan hanya tampilkan 10 film saja sesuai dengan output yang diharapkan

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

### 2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [66]:
# jawaban dari soal nomor 2
query = '''
select category.name as kategori, count(category.name) as jumlahMovie, avg(film.rental_rate) as rataHargaSewa from film
join film_category
on film.film_id = film_category.film_id
join category
on film_category.category_id = category.category_id
group by kategori
order by jumlahMovie desc
;
'''
pd.read_sql_query(query,engine)
# pertama, select kolom dan rename nama kolom yang ingin ditampilkan serta join 3 table berdasarkan key masing-masing table
# kemudian, kelompokkan data berdasarkan kategori
# terakhir, urutkan data tersebut berdasarkan jumlahMovie

       kategori  jumlahMovie  rataHargaSewa
0        Sports           74       3.125135
1       Foreign           73       3.099589
2        Family           69       2.758116
3   Documentary           68       2.666471
4     Animation           66       2.808182
5        Action           64       2.646250
6           New           63       3.116984
7         Drama           62       3.022258
8         Games           61       3.252295
9        Sci-Fi           61       3.219508
10     Children           60       2.890000
11       Comedy           58       3.162414
12     Classics           57       2.744386
13       Travel           57       3.235614
14       Horror           56       3.025714
15        Music           51       2.950784

### 3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak.

In [72]:
# jawaban dari soal nomor 3
query = '''
select actor.actor_id, actor.first_name, actor. last_name, count(film.title) as jumlah_Movie from actor
join film_actor
on actor.actor_id = film_actor.actor_id
join film
on film_actor.film_id = film.film_id
group by actor_id
order by jumlah_Movie desc
limit 10
;
'''
pd.read_sql_query(query,engine)
# pertama, select kolom dan rename nama kolom yang ingin ditampilkan serta join 3 table berdasarkan key masing-masing table
# kemudian, kelompokkan data berdasarkan actor_id
# terakhir, urutkan data tersebut berdasarkan jumlah_Movie (dari tinggi ke rendah) dan tampilkan 10 data teratas sesuai dengan output yang diharapkan

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

### 4. Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu kategori film dan jumlah film yang dibintangi.

In [106]:
# jawaban dari soal nomor 4
query = '''
select category.name as category, count(distinct(category.name)) as jumlah_Movie from category
join film_category
on category.category_id = film_category.category_id
join film
on film_category.film_id = film.film_id
join film_actor
on film_actor.film_id = film.film_id
join actor
on film_actor.actor_id = actor.actor_id
group by actor.actor_id
having (select count(film.title) from actor
join film_actor
on actor.actor_id = film_actor.actor_id
join film
on film_actor.film_id = film.film_id
group by actor.actor_id
order by count(film.title) desc
limit 1)

;
'''
pd.read_sql_query(query,engine)
# pertama, select kolom dan rename nama kolom yang ingin ditampilkan serta join 3 table berdasarkan key masing-masing table
# kemudian, kelompokkan data berdasarkan actor_id
# terakhir, urutkan data tersebut berdasarkan jumlah_Movie (dari tinggi ke rendah) dan tampilkan 10 data teratas sesuai dengan output yang diharapkan

      category  jumlah_Movie
0    Animation            13
1       Action            14
2       Action            10
3       Action            12
4       Action            13
..         ...           ...
195     Action            15
196     Action            16
197     Action            15
198     Action             8
199  Animation            10

[200 rows x 2 columns]

### 5. Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya

In [ ]:
select actor.actor_id from actor
join film_actor
on actor.actor_id = film_actor.actor_id
join film
on film_actor.film_id = film.film_id
group by actor_id
order by jumlah_Movie desc
limit 1